alphabet = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'


def decode(text):
    result = []
    for symbol in text:
        if symbol == ' ':
            result.append(None)
        else:
            result.append(alphabet.index(symbol))
    return result


# Пример 1

# Мой ответ:  [16, 17, 9, 2, 5, 19]
# Правильный: [16, 17, 9, 12, 15, 10]
# 1 -
# 2 -
# 3 -
# 4 - прибавил 10
# 5 - прибавил 10
# 6 - вычел 9
print(decode('привет'))


# Пример 2

# Мой ответ:  [16, 17, 9, 2, 5, 19]
# Правильный: [16, 17, 9, 12, 15, 10]
# 1 -
# 2 -
# 3 - прибавил 10
# 4 - вычел 9
# 5 -
# 6 -
print(decode('кодчик'))

# Пример 3
# 1 - прибавил 9
# 2 -
# 3 - вычел 9
# 4 - прибавил 10

# print(decode('трудная задачка'))
